---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetRight
source: html/7d8effe0-e0a3-f6bc-da60-7a9074fb163c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetRight Property

"Right Clip Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerBoundOffsetRight { get; }
```